app/Http/Controllers/AdminCategoryController.php

    public function index()
    {
        // $this->authorize('admin');
        return view('dashboard.categories.index', [
            'title' => 'Post Categories',
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`