app/Http/Controllers/DashboardPostController.php

    public function index()
    {
        return view('dashboard.posts.index', [
            'posts' => Post::where('user_id', auth()->user()->id)->get()
        ]);
---
SELECT * FROM `posts` WHERE `user_id` = 1

    public function create()
    {
        return view('dashboard.posts.create', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'title' => 'required|max:255',
            'slug' => 'required|unique:posts',
            'category_id' => 'required',
            'image' => 'image|file|max:2024',
            'body' => 'required'
        ]);

        if ($request->file('image')) {
            $validatedData['image'] = $request->file('image')->store('post-images');
        }

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['excerpt'] = str::limit(strip_tags($request->body), 200);

        Post::create($validatedData);
---
INSERT INTO `posts` (`title`, `slug`, `category_id`, `image`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) VALUES ('Stencil Graffiti', 'stencil-graffiti', '4', 'post-images/KUz28FhUaJTEwhyfU1HmHn8aNcWVb35Al5nJBPEd.jpg', '<div>sfsdf<br>sfsdf</div>', 1, 'sfsdfsfsdf', '2023-07-04 06:43:57', '2023-07-04 06:43:57')

    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'post' => $post,
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

    public function destroy(Post $post)
    {
        if ($post->image) {
            Storage::delete($post->image);
        }
        Post::destroy($post->id);

        return redirect('/dashboard/posts')->with('success', 'Post has been deleted!');
---
DELETE FROM `posts` WHERE `id` = 4
SELECT * FROM `posts` WHERE `id` in (4)